---
title: PipeSegment
classe: Autodesk.Revit.DB.Plumbing.PipeSegment
namespace: Autodesk.Revit.DB.Plumbing
eredita: Autodesk.Revit.DB.Segment
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 2
---

# PipeSegment

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `ElementId ScheduleTypeId { get; }` | `pipeSegment.ScheduleTypeId` | ElementId |
| `PipeSegment Create(Document, ElementId, ElementId, ICollection<MEPSize>)` | `PipeSegment.Create(ADocument, MaterialId, ScheduleId, sizeSet)` | PipeSegment |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```